import java.util.Scanner;

public class Main {
	public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        System.out.println(피보나치(n));
    }
	
    public static int 피보나치(int n) {
        if (n == 0) {
        	return 0;
        }
        if (n == 1) {
        	return 1;
        }
        return 피보나치(n - 1) + 피보나치(n - 2);
    }   
}
//피보나치(5)
//├─ 피보나치(4)
//│   ├─ 피보나치(3)
//│   │   ├─ 피보나치(2)
//│   │   │   ├─ 피보나치(1) → 1
//│   │   │   └─ 피보나치(0) → 0
//│   │   │   (피보나치(2) = 1 + 0 = 1)
//│   │   └─ 피보나치(1) → 1
//│   │   (피보나치(3) = 1 + 1 = 2)
//│   └─ 피보나치(2)
//│       ├─ 피보나치(1) → 1
//│       └─ 피보나치(0) → 0
//│       (피보나치(2) = 1 + 0 = 1)
//│   (피보나치(4) = 2 + 1 = 3)
//└─ 피보나치(3)
//    ├─ 피보나치(2)
//    │   ├─ 피보나치(1) → 1
//    │   └─ 피보나치(0) → 0
//    │   (피보나치(2) = 1 + 0 = 1)
//    └─ 피보나치(1) → 1
//    (피보나치(3) = 1 + 1 = 2)
//
//피보나치(5) = 3 + 2 = 5